  {
      "input": "productCategory: Moisturizer; skinType: Oily; targetConcerns: Hydration; ingredients: Water, Glycerin, Hyaluronic Acid; texture: Gel; spf: 15; brand: LuxeGlow; description: Lightweight gel moisturizer; title: Hydrating Gel Moisturizer; usageInstructions: Apply to face after cleansing and toning.",
      "output": "1. Cleanse face with a gentle cleanser. 2. Apply toner. 3. Use serum if needed. 4. Apply the Hydrating Gel Moisturizer evenly over the face. 5. Follow with sunscreen in the morning."
  }
  {
      "input": "productCategory: Serum; skinType: Dry; targetConcerns: Anti-aging; ingredients: Retinol, Vitamin C, Hyaluronic Acid; texture: Liquid; spf: 0; brand: PureEssence; description: Anti-aging serum with retinol; title: Retinol Anti-Aging Serum; usageInstructions: Use at night after cleansing.",
      "output": "1. Cleanse face thoroughly. 2. Apply toner. 3. Dispense a few drops of Retinol Anti-Aging Serum and pat into skin. 4. Follow with a moisturizer. 5. Use sunscreen during the day."
  }
  {
      "input": "productCategory: Cleanser; skinType: Combination; targetConcerns: Pore Minimizing; ingredients: Salicylic Acid, Tea Tree Oil; texture: Foam; spf: 0; brand: AquaVita; description: Deep cleansing foam for pores; title: Pore Minimizing Cleanser; usageInstructions: Use twice daily.",
      "output": "1. Wet face with lukewarm water. 2. Apply Pore Minimizing Cleanser and massage gently. 3. Rinse thoroughly. 4. Follow with toner and moisturizer."
  }
  {
      "input": "productCategory: Sunscreen; skinType: All; targetConcerns: Sun Protection; ingredients: Zinc Oxide, Titanium Dioxide; texture: Cream; spf: 50; brand: PureEssence; description: Broad-spectrum mineral sunscreen; title: Mineral Sunscreen SPF 50; usageInstructions: Apply generously before sun exposure.",
      "output": "1. Cleanse and moisturize face. 2. Apply Mineral Sunscreen SPF 50 generously 15 minutes before sun exposure. 3. Reapply every two hours or after swimming or sweating."
  }
  {
      "input": "productCategory: Eye Cream; skinType: Sensitive; targetConcerns: Dark Circles; ingredients: Caffeine, Vitamin K; texture: Cream; spf: 0; brand: AquaVita; description: Brightening eye cream for dark circles; title: Dark Circle Eye Cream; usageInstructions: Use morning and night.",
      "output": "1. Cleanse face and apply toner. 2. Use ring finger to gently pat Dark Circle Eye Cream around the eye area. 3. Follow with moisturizer and sunscreen in the morning."
  }
    {
      "input": "productCategory: Toner; skinType: Normal; targetConcerns: Brightening; ingredients: Niacinamide, Licorice Extract; texture: Liquid; spf: 0; brand: Celestial Care; description: Brightening toner for even skin tone; title: Radiance Boosting Toner; usageInstructions: Apply after cleansing.",
      "output": "1. Cleanse face with a gentle cleanser. 2. Apply Radiance Boosting Toner using a cotton pad or hands. 3. Follow with serum and moisturizer."
  }
  {
      "input": "productCategory: Face Mask; skinType: Dry; targetConcerns: Hydration; ingredients: Aloe Vera, Shea Butter; texture: Cream; spf: 0; brand: Celestial Care; description: Hydrating face mask for dry skin; title: Deep Moisture Face Mask; usageInstructions: Use 2-3 times a week.",
      "output": "1. Cleanse face thoroughly. 2. Apply a generous layer of Deep Moisture Face Mask. 3. Leave on for 15-20 minutes. 4. Rinse off with lukewarm water. 5. Follow with toner and moisturizer."
  }
  {
      "input": "productCategory: Exfoliator; skinType: Oily; targetConcerns: Blackheads; ingredients: Salicylic Acid, Charcoal; texture: Scrub; spf: 0; brand: Celestial Care; description: Exfoliating scrub for blackhead removal; title: Charcoal Exfoliating Scrub; usageInstructions: Use twice a week.",
      "output": "1. Wet face with warm water. 2. Apply Charcoal Exfoliating Scrub and massage gently in circular motions. 3. Rinse thoroughly. 4. Follow with toner and moisturizer."
  }
  {
      "input": "productCategory: Night Cream; skinType: Mature; targetConcerns: Firming; ingredients: Peptides, Collagen; texture: Cream; spf: 0; brand: LuxeGlow; description: Firming night cream for mature skin; title: Firming Night Cream; usageInstructions: Apply nightly before bed.",
      "output": "1. Cleanse face and apply toner. 2. Use serum if desired. 3. Apply Firming Night Cream evenly over face and neck. 4. Avoid eye area."
  }
  {
      "input": "productCategory: Lip Balm; skinType: All; targetConcerns: Chapped Lips; ingredients: Beeswax, Vitamin E; texture: Balm; spf: 15; brand: LuxeGlow; description: Nourishing lip balm with SPF; title: SPF Lip Balm; usageInstructions: Apply as needed.",
      "output": "1. Apply SPF Lip Balm to lips as needed throughout the day. 2. Reapply after eating or drinking. 3. Use before sun exposure for protection."
  }
